//
// Copyright © 2003-2010, by YaPB Development Team. All rights reserved.
//
// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
// THE SOFTWARE.
//
// Trampolines.hpp
//
// Namespace: Trampolines
//
// Version: $ID:$
//

#if defined _MSC_VER && _MSC_VER > 1000
#	pragma once
#endif	// if defined _MSC_VER && _MSC_VER > 1000

#ifndef TRAMPOLINES_INCLUDED
#define TRAMPOLINES_INCLUDED

namespace Trampolines
{
	// Reliability checks.
	CompileTimeAssert (sizeof (int) == sizeof (long));
	CompileTimeAssert (sizeof (bool) == sizeof (char));
	CompileTimeAssert (sizeof (bool) == 1u);
	CompileTimeAssert (sizeof (BOOL) == 4u);
	CompileTimeAssert (sizeof (char) == 1u);
	CompileTimeAssert (sizeof (short) == 2u);
	CompileTimeAssert (sizeof (int) == 4u);
	CompileTimeAssert (sizeof (long) == 4u);
	CompileTimeAssert (sizeof (enum Test_t) == 4u);
	CompileTimeAssert (sizeof (long long) == 8u);
	CompileTimeAssert (sizeof (float) == 4u);
	CompileTimeAssert (sizeof (double) == 8u);

	/**
	* List of x86 bytecodes for creating basic trampolines at runtime.
	* -
	* These are defined here so that, should
	* the need ever arise, this can be ported
	* to other architectures fairly painlessly.
	*/
	namespace Bytecode
	{
/**             32 bit                32 bit                32 bit                32 bit
		•———————————————————• •———————————————————• •———————————————————• •———————————————————•
		|        EAX        | |        ECX        | |        EDX        | |        EBX        |
		|———————————————————| |———————————————————| |———————————————————| |———————————————————|
		|         |   AX    | |         |   CX    | |         |   DX    | |         |   BX    |
		|———————————————————| |———————————————————| |———————————————————| |———————————————————|
		|         | AH | AL | |         | CH | CL | |         | DH | DL | |         | BH | BL |
		•———————————————————• •———————————————————• •———————————————————• •———————————————————•

